package com.app.view

/**
 * кастомные атрибуты атрибуты
 * параметры конструктора View и ViewGroup
 * Более подробно расписать LifeCycleView. Мне непонятно зачем парные методы к onMeasure, onLayout и onDraw если переопределяем поведение только в методах с префиксом on
 *
 * Что будет если задать размер View в sp?
 * Детально расписать специальное значение 0dp в Linear и ConstrainLayout
 *
 * Позже
 * Расписать LayoutParams и как с ним работать из кода
 *
 * todo
 * Задача реализовать свой Paint
 * Задача реализовать огонь
 * */