package com.app.view

/**
 * requestLayout()
 * invalidate()
 *
 * Показать варианты реализации CustomView через View, Viewgroups
 *
 *
 *
 *
 * Атрибуты
 * Расписать StateFull и StateLess вьюхи. Способность сохранять состояние в bundle и ка кна это
 * влияет отсутствие или присутствие айдишника
 *
 * Что будет если задать размер View в sp?
 * Детально расписать специальное значение 0dp в Linear и ConstrainLayout
 * Расписать как делать виджеты и правильно ли я понимаю значение этого слова
 *
 *
 * Позже
 * Расписать LayoutParams и как с ним работать из кода
 *
 * todo
 * Задача реализовать свой Paint
 * Задача реализовать огонь
 *
 * */