package com.app.navigation

/**
 * 1.Способ создания и конструктор.
 * 2.Layout в constructor
 * 3.Отправка результата
 * - Brother - Brother, Parent - child

 * 1. Рассмотреть способы передачи инфы на фрагмент
 * ЖЦ и почему добавилены доп методы. Разделение на Жц фрагмента и вью
 * почему нельзя переопределять конструктор
 * Повторение транзакций после изменения конфигурации if(savedInstanceState != null)
 * retainInstance = true (отключение пересоздания при пересоздании активити) когда нужно использовать

 * */